-- Написати функції для виконання завдань:
-- а) не застосовуючи вбудованих функцій;
-- б) з використанням вбудованих функцій;
-- в) з використанням (можливо власних) функцій вищого порядку.
-- Передбачити обробку списку вхідних даних.
-- У звіті мають бути представлені задачі, остання цифра яких збігається з
-- останньою цифрою номера студента у списку групи. Вміти виконувати довільне
-- завдання.
-- 1.Знайти останній елемент списку.

module Lab2_1 where

lastNumber :: Num x => [x] ->  x
lastNumber [] = 0
lastNumber [x] = x
lastNumber (_:xs) = last xs

