-- Для представлених далі задач:
-- а) визначте типи;
-- б) визначте вказані функції;
-- в) визначте хоча б один оператор.
-- Для демонстрації роботи функцій треба створити базу даних у формі
-- списку. Запропонуйте кілька варіантів функції.
-- У звіті мають бути представлені задачі, остання цифра яких збігається з
-- останньою цифрою номера студента у списку групи. Вміти виконувати довільне
-- завдання.
-- Фігури на площині. Використовуються такі фігури, як коло (центр та радіус),
-- прямокутник (координати лівої верхньої та правої нижньої точок), трикутник
-- (координати вершин) та мітка — label (координати лівої нижньої точки, шрифт
-- та рядок). Доступні шрифти — Consolas, Lucida Console та Source Code Pro.
-- Визначне функції для:
-- 1. обчислення площі фігури (для мітки — через розмір одного символу та
-- їх кількість);

module Lab3 where